<a href="https://colab.research.google.com/github/JAYDEEPMISHR/PYTHON/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_excel(r'sample_data/SalaryData.xlsx')
print(df)

     NAME  EMPID  SALARY Month
0     ABC      1   10000   Jan
1     XYZ      2   10000   Jan
2     PQR      3   10000   Jan
3     STU      4   10000   Jan
4    DSDS      5   10000   Jan
5    CVSD      6   10000   Jan
6    DCSD      7   10000   Jan
7     DCX      8   10000   Jan
8   DSCSD      9   10000   Jan
9   SDCXC     10   10000   Jan
10    C X     11   10000   Jan
11    SFS     12   10000   Jan
12     GD     13   10000   Jan
13    GDX     14   10000   Jan
14     SG     15   10000   Jan
15      F     16   10000   Jan
16  hskjh     17   10000   Jan

In [6]:
print(df.head()) # Gives the first data(default Five record from the database)

   NAME  EMPID  SALARY Month
0   ABC      1   10000   Jan
1   XYZ      2   10000   Jan
2   PQR      3   10000   Jan
3   STU      4   10000   Jan
4  DSDS      5   10000   Jan

In [9]:
print(df.head(7)) # If you want to see 7 records from the data

   NAME  EMPID  SALARY Month
0   ABC      1   10000   Jan
1   XYZ      2   10000   Jan
2   PQR      3   10000   Jan
3   STU      4   10000   Jan
4  DSDS      5   10000   Jan
5  CVSD      6   10000   Jan
6  DCSD      7   10000   Jan

In [10]:
print(df.tail()) # Gives the last five record (bydefault) from the database

     NAME  EMPID  SALARY Month
12     GD     13   10000   Jan
13    GDX     14   10000   Jan
14     SG     15   10000   Jan
15      F     16   10000   Jan
16  hskjh     17   10000   Jan

In [11]:
print(df.tail(1))

     NAME  EMPID  SALARY Month
16  hskjh     17   10000   Jan

In [12]:
print(df.info()) # If you want to get the information about the database

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    17 non-null     object
 1   EMPID   17 non-null     int64
 2   SALARY  17 non-null     int64
 3   Month   17 non-null     object
dtypes: int64(2), object(2)
memory usage: 676.0+ bytes
None

In [13]:
# Describe the statistical information of the numerical coloums (Gives only numerical coloums)
print(df.describe())

           EMPID   SALARY
count  17.000000     17.0
mean    9.000000  10000.0
std     5.049752      0.0
min     1.000000  10000.0
25%     5.000000  10000.0
50%     9.000000  10000.0
75%    13.000000  10000.0
max    17.000000  10000.0

In [14]:
# To get all the coloums
print(df.columns)

Index(['NAME', 'EMPID', 'SALARY', 'Month'], dtype='object')

In [15]:
# Do the transpose of the dataframe
print(df.T)

           0      1      2      3      4      5      6      7      8      9   \
NAME      ABC    XYZ    PQR    STU   DSDS   CVSD   DCSD    DCX  DSCSD  SDCXC
EMPID       1      2      3      4      5      6      7      8      9     10
SALARY  10000  10000  10000  10000  10000  10000  10000  10000  10000  10000
Month     Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan

           10     11     12     13     14     15     16
NAME      C X    SFS     GD    GDX     SG      F  hskjh
EMPID      11     12     13     14     15     16     17
SALARY  10000  10000  10000  10000  10000  10000  10000
Month     Jan    Jan    Jan    Jan    Jan    Jan    Jan

In [20]:
# Sort a values according to coloums
print(df.sort_values('NAME'))

     NAME  EMPID  SALARY Month
0     ABC      1   10000   Jan
10    C X     11   10000   Jan
5    CVSD      6   10000   Jan
6    DCSD      7   10000   Jan
7     DCX      8   10000   Jan
8   DSCSD      9   10000   Jan
4    DSDS      5   10000   Jan
15      F     16   10000   Jan
12     GD     13   10000   Jan
13    GDX     14   10000   Jan
2     PQR      3   10000   Jan
9   SDCXC     10   10000   Jan
11    SFS     12   10000   Jan
14     SG     15   10000   Jan
3     STU      4   10000   Jan
1     XYZ      2   10000   Jan
16  hskjh     17   10000   Jan

In [22]:
# If we want to print perticular coloum
print(df['NAME']) # or print(df.NAME) but this only wokrs when the coloum name is not having some blank space in the spelling

0       ABC
1       XYZ
2       PQR
3       STU
4      DSDS
5      CVSD
6      DCSD
7       DCX
8     DSCSD
9     SDCXC
10      C X
11      SFS
12       GD
13      GDX
14       SG
15        F
16    hskjh
Name: NAME, dtype: object

In [23]:
# If we want to add new coloum than also we can add
df['Stipend'] = 1000

In [24]:
print(df.head(2)) # stipend is added as a new coloum

  NAME  EMPID  SALARY Month  Stipend
0  ABC      1   10000   Jan     1000
1  XYZ      2   10000   Jan     1000

In [25]:
df['NEW SALARY'] = df['SALARY'] + df['Stipend']
print(df['NEW SALARY'])

0     11000
1     11000
2     11000
3     11000
4     11000
5     11000
6     11000
7     11000
8     11000
9     11000
10    11000
11    11000
12    11000
13    11000
14    11000
15    11000
16    11000
Name: NEW SALARY, dtype: int64

In [26]:
print(df.head(2))

  NAME  EMPID  SALARY Month  Stipend  NEW SALARY
0  ABC      1   10000   Jan     1000       11000
1  XYZ      2   10000   Jan     1000       11000

In [28]:
df[3,5] # Accessing rows through dataframe (Wrong Syntax)

KeyError: (3, 5)

In [29]:
print(df[3:5])  # Right Syntax

   NAME  EMPID  SALARY Month  Stipend  NEW SALARY
3   STU      4   10000   Jan     1000       11000
4  DSDS      5   10000   Jan     1000       11000

In [32]:
print(df)

     NAME  EMPID  SALARY Month  Stipend  NEW SALARY
0     ABC      1   10000   Jan     1000       11000
1     XYZ      2   10000   Jan     1000       11000
2     PQR      3   10000   Jan     1000       11000
3     STU      4   10000   Jan     1000       11000
4    DSDS      5   10000   Jan     1000       11000
5    CVSD      6   10000   Jan     1000       11000
6    DCSD      7   10000   Jan     1000       11000
7     DCX      8   10000   Jan     1000       11000
8   DSCSD      9   10000   Jan     1000       11000
9   SDCXC     10   10000   Jan     1000       11000
10    C X     11   10000   Jan     1000       11000
11    SFS     12   10000   Jan     1000       11000
12     GD     13   10000   Jan     1000       11000
13    GDX     14   10000   Jan     1000       11000
14     SG     15   10000   Jan     1000       11000
15      F     16   10000   Jan     1000       11000
16  hskjh     17   10000   Jan     1000       11000

In [35]:
new_df = df[df.EMPID > 5]
print(new_df)
print("New Length is: ",len(new_df))

     NAME  EMPID  SALARY Month  Stipend  NEW SALARY
5    CVSD      6   10000   Jan     1000       11000
6    DCSD      7   10000   Jan     1000       11000
7     DCX      8   10000   Jan     1000       11000
8   DSCSD      9   10000   Jan     1000       11000
9   SDCXC     10   10000   Jan     1000       11000
10    C X     11   10000   Jan     1000       11000
11    SFS     12   10000   Jan     1000       11000
12     GD     13   10000   Jan     1000       11000
13    GDX     14   10000   Jan     1000       11000
14     SG     15   10000   Jan     1000       11000
15      F     16   10000   Jan     1000       11000
16  hskjh     17   10000   Jan     1000       11000
New Length is:  12

In [37]:
# Using the fillna we can fill the null values with it
df['SALARY'].fillna(10) # So null values which are present in the salary coloum fill with 10

0     10000
1     10000
2     10000
3     10000
4     10000
5     10000
6     10000
7     10000
8     10000
9     10000
10    10000
11    10000
12    10000
13    10000
14    10000
15    10000
16    10000
Name: SALARY, dtype: int64

In [43]:
# To remove some coloums from the dataframe than use .pop or .drop methods in the pandas
print(df2.head())

0    Jan
1    Jan
2    Jan
3    Jan
4    Jan
Name: Month, dtype: object

In [44]:
print(df.head(2))

  NAME  EMPID  SALARY  Stipend
0  ABC      1   10000     1000
1  XYZ      2   10000     1000

In [46]:
# To apply some mathematical operation on the coloum than we have to use .apply method
print(df['SALARY'].apply(lambda x: x*2))
print(df['SALARY'].apply(np.sqrt))

0     20000
1     20000
2     20000
3     20000
4     20000
5     20000
6     20000
7     20000
8     20000
9     20000
10    20000
11    20000
12    20000
13    20000
14    20000
15    20000
16    20000
Name: SALARY, dtype: int64
0     100.0
1     100.0
2     100.0
3     100.0
4     100.0
5     100.0
6     100.0
7     100.0
8     100.0
9     100.0
10    100.0
11    100.0
12    100.0
13    100.0
14    100.0
15    100.0
16    100.0
Name: SALARY, dtype: float64